app/controllers/potzes_controller.rb

  def show

    @potze = Potze.find(params[:id])
---
SELECT `potzes`.* FROM `potzes` WHERE `potzes`.`id` = 1 LIMIT 1

  def edit
    @potze = Potze.find(params[:id])
---
SELECT `potzes`.* FROM `potzes` WHERE `potzes`.`id` = 1 LIMIT 1

  def update
    @potze = Potze.find(params[:id])
---
SELECT `potzes`.* FROM `potzes` WHERE `potzes`.`id` = 1 LIMIT 1

  def destroy
    @potze = Potze.find(params[:id])
    @potze.destroy
---
SELECT `potzes`.* FROM `potzes` WHERE `potzes`.`id` = 1 LIMIT 1
DELETE FROM `potzes` WHERE `potzes`.`id` = 1